# DIT - это распределенная система контроля версий
# Это система для отслеживание и ведения истории изменения файлов в нашем проекте. При помощи git можно оргонизовать командную работу. 

# GitHub - это веб-сайт для размещения git-репозиториев в совместной разработке проектов

# Репозиторий - это хранилище нашего кода и истории его изменений 

# Команда Git:
# 1. Git init - создает удаленый репазиторий в той директории в кторой была прописана команда 
# 2. git add . - команнда для добавления именений в систему отслеживание гита. (вместо точки можно прописать название директории)
# 3. git cimmit -m 'something' это команда для сохранения всех именений с комментарием е гим. 
# 4. git branch -M main - это команда переименовывет главную ветку master на main.
# 5. git remote add origin 'url' - эта команда связывает нашей локальный репозиторий с удаленным репозиторий на гитхабе.
# 6. git push origin <main> - эта команда отправки наших изменений на удаленный репозиторий.

'================================================================================================================================='
# git status - показывает статус репазитория (какие изменения не закомичены)
# git branch - показывает на какой ветке вы находитесь.
